{
    "file_name": "tutorials.md",
    "sections": [
        {
            "header": "Tutorials",
            "content": "\n"
        },
        {
            "header": "How to Create an Articles Page",
            "content": "\n<h3>Create Object Type</h3>\n<ul>\n<li>Go to Objects page</li>\n<li>Click on Add New Record</li>\n<li>Fill out the form as follows</li>\n</ul>\n<p>Name: Articles (User Friendly name of the Object Type)\nTable Name: articles (Table name of the Object (lower case, no psecial characters))\nSEO: article/%name% (which will automatically create links using the <code>name</code> field from article)\nMenu: Main Menu (which will create a main level menu for the new Object Type)\nHas Item: Checked\nDesign: (to be defined after creating new design) /<em> TODO: Add create new design button </em>/</p>\n<ul>\n<li>Click save and it will redirect automatically to add new Object Spec Page.</li>\n<li>Fill out the form as follows to add a new field to Object Type:</li>\n</ul>\n<p>Name: Name (User Friendly name of the field)\nType: string (It will be a text field)\nListed: Checked (To be listed in Listing Page)\nRequired: Checked\nSearchable: Checked\nMenu: Main Menu (to Create a link on Admin Panel)</p>\n<ul>\n<li>\n<p>Click save and it will reload to add a new field.</p>\n</li>\n<li>\n<p>Now we have a table named <code>articles</code> in our database,</p>\n</li>\n<li>We have an Admin Panel that we can search, add, edit or delete contents.</li>\n</ul>\n"
        },
        {
            "header": "Adding AMP (Accelerated Mobile Pages) Support to a Website",
            "content": "\n<p>Accelerated Mobile Pages are lightweight version of a website that aims Mobile Pages to be cached on Google. You can get \ndetailed information about AMP from Google's <a href=\"https://amp.dev/\">AMP Website</a></p>\n<p>Technically if you would like to add AMP Support for your website, you need to create AMP Versions of the pages. Most \nplatforms suffers from managing content of these pages seperately which causes additional effort to maintain content of \nAMP Pages.</p>\n<h3>Creating AMP Version of the Design</h3>\n<p>First of all, you need to Create seperate Layout and Designs for AMP:</p>\n<ul>\n<li>Step 1 - Create Layout under app/Views/LayoutAmp.twig and Create Admin Record from /admin/cms_layout/add</li>\n<li>Step 2 - Create Design from (/admin/cms_design/add) and chose special layout you have created for AMP.</li>\n<li>Step 3 - Create new Widgets specialized for AMP using bin/butterfly make:widget or make:content-widget commands.</li>\n<li>Step 4 - Run <code>bin/butterfly widget:refresh</code> Command and add widgets to AMP Designs.</li>\n</ul>\n<blockquote>\n<p>[!TIP]\nYou can use <code>info</code> variable to access content details in <code>Widgets</code></p>\n<p>[!TIP]\nYou should repeat the previous steps for each Object Type you want to specialize for AMP.</p>\n</blockquote>\n<p>Now you have special designs, widgets and a layout for AMP. We need to define a new URL Format that will render the same \npage as AMP.</p>\n<p>We have two different way of defining the new page format:</p>\n<h3>Strategy - 1 - Using Object Subpages Feature</h3>\n<p>Butterfly Subpages feature helps you add multiple url's for a specific Content Item. To add AMP Support for a Content Type, \nyou can follow these steps:</p>\n<p>Now we will create Object Subpage Record for the Object:</p>\n<ul>\n<li>On Admin Panel, go to Object Subpages</li>\n<li>Choose Object to create AMP Version</li>\n<li>Enter amp/%seo% to create a new URL Format that will prepend amp/ to a URL.</li>\n<li>Choose AMP Version of the Design you have created in the <a href=\"https://thebutterfly.io/docs/#/design?id=creating-amp-version-of-the-design\">previous step</a></li>\n<li>Save</li>\n</ul>\n<p>Now, every time a new content (Item) is created, amp/*** version of the page which will be rendered for AMP will automatically created.</p>\n<blockquote>\n<p>[!WARNING]\nThis strategy creates a record for each item in <code>item_subpages</code> table which means that if you have millions of records in a table,\nthis will create same amount of record under this table.\nIf you have more than 10.000 record in a table, we suggest second strategy.</p>\n</blockquote>\n<h3>Strategy 2 - Add a new URL Format and Design Prefix using Hooks</h3>\n<ul>\n<li>Create Frontend / Bootstrap Hook to detect url's starting with amp/</li>\n</ul>\n<p>Run <code>bin/butterfly make:event Frontend Bootstrap</code></p>\n<p>Update <code>app/Event/Frontend.php</code> file with the following:</p>\n<p>```php\n&lt;?php</p>\n<p>namespace App\\Event;</p>\n<p>use Butterfly\\Framework\\Registry\\Registry;\nuse Butterfly\\Library\\Hook;</p>\n<p>class Frontend extends Hook\n{\n    public function Bootstrap()\n    {\n        $url = Registry::get('url');</p>\n<pre><code>    if(substr($url, 0, 4) == 'amp/')\n    {\n        Registry::set('amp', true);\n        Registry::set('url', substr($url, 4));\n    }\n}\n</code></pre>\n<p>}\n```</p>\n<p>this code will remove <code>amp/</code> from URL and set amp -&gt; true to Registry.</p>\n<ul>\n<li>Update <code>app/Controller/Item.php</code> as the following:</li>\n</ul>\n<p>```php\n&lt;?php\nnamespace App\\Controller;</p>\n<p>use Butterfly\\Framework\\Registry\\Registry;</p>\n<p>class Item extends \\Butterfly\\Core\\Controller\\Frontend\\Item\n{\n    public function getDetails()\n    {\n        if(Registry::get('amp'))\n        {\n            $this-&gt;designPrefix = 'amp-';\n        }</p>\n<pre><code>    parent::getDetails();\n}\n</code></pre>\n<p>}\n```</p>\n<p>this code will set design prefix check if amp key in the registry is set to true.</p>\n<p>Now you can create AMP versions of the Designs by adding <code>amp-</code> prefix to existing design aliases.</p>\n<p>For example:\nIf your article page Design's alias is: <code>article-detail</code>, then you should set <code>amp-article-detail</code> as alias in the AMP \nVersion.</p>"
        }
    ]
}